{"clips":[{"slug":"clip1","name":"How Fire Feeds","link":"http://fire.revealnews.org/","newsroom":"CIR","image":"fire.png","copy":"An interactive narrative that shows how three massive forest fires spiraled out of control. This story won a Philip Meyer Award in 2016 for data journalism."},{"slug":"clip2","name":"The Promised Land","link":"http://apps.revealnews.org/transmountain","newsroom":"CIR","image":"promised.png","copy":"I designed, laid out, and programmed this unique story format for a narrative about a controversial Canadian oil pipeline. Scroll-based events triggered animations on a custom map, orienting the user as he reads through the piece. "},{"slug":"clip3","name":"Homegrown Terror","link":"http://apps.revealnews.org/homegrown-terror","newsroom":"CIR/The Investigative Fund","image":"terror.png","copy":"I helped to build and analyze a unique database of domestic terror incidents. I built an interactive application to view and map these incidents."},{"slug":"clip4","name":"How Militarized Are California Police?","link":"http://www.nbcbayarea.com/blogs/frameshift/How-Militarized-are-California-Police-274380751.html","newsroom":"NBC","image":"police.png","copy":"This story analyzes a huge federal dataset that indicates how much military gear each state has obtained through the “1033” Department of Defense program. Features an interactive map and an interactive chart, both in D3.js."},{"slug":"clip5","name":"Bay Area Quake Map","link":"http://scottpham.xyz/quake-map-ractive/","newsroom":"NBC","image":"quakes.png","copy":"This map accesses the USGS API to bring an always up-to-date view of earthquakes in the immediate Bay Area. User interactions on the table update the map’s view and vice-versa."},{"slug":"clip6","name":"The Leakiest Cities in the Bay","link":"https://data.nbcstations.com/national/KNTV/scottpham/water-facet/","newsroom":"NBC","image":"pipes.png","copy":"This collection of “small multiples” provides easy comparison across two categories: place and year. The bar charts, written in D3.js, are “linked”, allowing mouse events in one chart to produce effects in all the others."}]}